ワンタイムパスワード　パスワードを毎回変換する
チャレンジレスポンス方式　サーバが乱数（チャレンジ）を生成してクライアントに送信
クライアントはパスワードとチャレンジを組み合わせて演算した結果（レスポンス）をサーバに送る
サーバは生成したチャレンジを変換したものとレスポンスを比較して一致した場合に認証
データを盗聴されてもパスワードがわからない
デバイス認証　本人しか持ちえないICカードなどを使って認証
シングルサインオン　１回のログインでほかのサイトの認証いらない
バイオメトリクス認証　本人拒否率（FRR）　FA（合う）R他人じゅにゅう率
リスクマネジメント　リスクの特定、分析、評価の順で行われる
ISMS　PDCAを継続的に行う
ファイアウォール　通信内容検査して通過か遮断を判断する
インターネットと内部ネットワークの間にある。
パケットフィルタリング　送信先、宛先のIPアドレスとポート番号を用いて不正な通信遮断
SSL/TLS TLS=SSLの後継ぎ規約でクライアンととサーバの通信暗号化するプロトコル
ブロックチェーン　改竄（かいざん）できないよう取引情報紐づけている
取引の記録を記憶域ブロックに記録
各ブロックに前回までの取引内容を表す情報ハッシュ地を格納
改竄した場合、ハッシュ地とブロック地の整合性が合わない

コンペアほう　ファイルを原本と比較する
チェックサム法　合計地と比較する
パターンマッチング法　ウイルスに特徴的なパターンないかチェック
ビヘイビア法　仮想環境上で実行して、ウイルスの挙動ないか調べる
IDS　侵入検知システム　IDがログインしてきたら検知
IPS　侵入防御システム　IPはパケットフィルタリング（防御）に使われる

検疫ネットワーク　PCがインターネットに接続した際、PCが一定のセキュリティ水準を満たしたものだけアクセスできる
MDM　スマートデバイスを従業員に渡す場合、セキュリティなどの設定を統合的に管理する
ディジタルフォレンジックス　不正アクセスの分析などをITを利用して行うこと
ペネトレーションテスト　侵入テスト
サンドボックス　仮想環境構築して、その中で怪しいプログラムを動作させる
サンドボックスはビヘイビア法の1つ
ステガノグラフィ（電子透かし）画像などに団参者に気づかれない情報埋め込む
埋め込む情報が著作権情報の場合、電子透かしという
WPA　WPA2　むせんLAN での暗号通信　WPAより暗号度高いのがWPA2
ハニーポット　あえて攻撃者の侵入を許し、攻撃手法を分析するためのプログラム
